module.exports = {
    start: (firstName) => `Ассалому алайкум ${firstName},\n
🤖 Ушбу бот орқали сиз қидираётган домен номини бўш ёки рўйхатдан ўтганлигини билиб олишингиз мумкин.\n
Домен номи охирига <b>.uz</b> қўшимчасини қўшиб ботга юборинг. 
⚠️ <b>Эслатма:</b> ушбу бот фақат <b>Уз доменларни</b> текшириб бера олади.\n
<b>Bot muallifi:</b> @muzaffarovadham
<b>Github:</b> https://github.com/Adkhambek/UZ-domenlarni-tekshiruvchi-bot`,
    validError: `<b>❌ Домен хато киритилган</b>\n
киритилаётган домен қуйидаги қоидаларга тўғри келиши керак:\n
<i>1. Белгилар фақат қуйидагилардан иборат бўлиши керак a-z | А-Z | 0-9, нуқта(.) ва чизиқча(-).</i>
<i>2. Домен номининг бошланиши ёки тугаши чизиқча(-) билан бошланмаслиги</i>
<i>3. Домен белгилар сони 1-63 оралиғида бўлиши</i>`,
    registredDomain: (
        name,
        status,
        dateCreated,
        activeUntil
    ) => `📌 <b>Домен ҳақида маълумот:</b>\n
<b>Домен номи:</b> ${name} 
<b>Ҳолати:</b> ${status}
<b>Рўйхатдан ўтган сана:</b> ${dateCreated}
<b>Фаолияти тугайди:</b> ${activeUntil}`,
    dotuzError: `❌ Домен хато киритилган ёки Уз доменга тегишли эмас.\n
Илтимос, қайтадан тўғрилаб киритинг.`,
    error: "Хатолик бор. /start ни босиб бошидан киритиб кўринг.",
};
